Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПорядокОкругленияСтоимостиПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОкруглятьВБольшуюСторонуСтоимостьПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылочныйВидЦены</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаПродукцию</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаУслугиПроизводства</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценкиОтБП1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныПродукции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>#12082 отключена проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругленияЧислом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеКоличество</Name>
							<Comment>#88</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УстановкаЦенСервер/Ext/Module.bsl
#Область УстановкаЦенОбщее

// использование: 
// - Документ.УстановкаЦенМатериалов.Форма.ФормаДокумента
// - Документ.УстановкаЦенНоменклатуры.Модуль объекта
// - Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента
Функция ЗаполнитьИспользуемыеВидыЦен(ФормаОбъект, ТаблицаВидовЦен = Неопределено) Экспорт
	
	ЕстьИспользуемыеЦены = ЗаполнитьИспользуемыеВидыЦенПользователя(ФормаОбъект, ТаблицаВидовЦен);
	
	//#13646
	Если ТипЗнч(ФормаОбъект) = Тип("УправляемаяФорма") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаВидовЦен", ФормаОбъект.ВидыЦен.Выгрузить()); 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаВидовЦен.Запрещенный КАК Запрещенный,
		|	ТаблицаВидовЦен.Устанавливать КАК Устанавливать,
		|	ТаблицаВидовЦен.Код КАК Код,
		|	ТаблицаВидовЦен.ПометкаУдаления КАК ПометкаУдаления,
		|	ТаблицаВидовЦен.Порядок КАК Порядок,
		|	ТаблицаВидовЦен.ИмяКолонки КАК ИмяКолонки,
		|	ТаблицаВидовЦен.ВидЦены КАК ВидЦены
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаВидовЦен КАК ТаблицаВидовЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЦен.Ссылка КАК ВидЦены,
		|	ЕСТЬNULL(Вт.Устанавливать, ЛОЖЬ) КАК Устанавливать,
		|	ЕСТЬNULL(Вт.Запрещенный, ЛОЖЬ) КАК Запрещенный,
		|	ЕСТЬNULL(Вт.ИмяКолонки, """") КАК ИмяКолонки,
		|	ЕСТЬNULL(Вт.Порядок, 99999) КАК Порядок,
		|	ВидыЦен.Код КАК Код,
		|	ВидыЦен.Наименование КАК Наименование,
		|	ВидыЦен.ПометкаУдаления КАК ПометкаУдаления,
		|	ВидыЦен.ЭтоГруппа КАК ЭтоГруппа,
		|	ВидыЦен.Архивный КАК Архивный
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК Вт
		|		ПО (Вт.ВидЦены = ВидыЦен.Ссылка)
		|ГДЕ
		|	(НЕ Вт.ВидЦены ЕСТЬ NULL
		|			ИЛИ ВидыЦен.ЭтоГруппа)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЦен.Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Дерево.Строки.Сортировать("ЭтоГруппа УБЫВ, Порядок, Наименование", Истина); //#14002 порядок как в документе
		
		УбратьНеиспользуемыеГруппыРекурсивно(Дерево.Строки);
		ИзменитьПризнакУстанавливатьДляГрупп(Дерево);
		
		ФормаОбъект.ЗначениеВРеквизитФормы(Дерево, "ДеревоВидовЦен");
		
		// #14002 в вспомогательной таблице ВидыЦен заполнить порядок как в дереве, начиная сверху
		ФормаОбъект.ВидыЦен.Очистить();
		ЗаполнитьВидыЦенРекурсивно(Дерево.Строки, ФормаОбъект.ВидыЦен);
	КонецЕсли;

	Возврат ЕстьИспользуемыеЦены;
	
КонецФункции

// использование:
// - функция ЗаполнитьИспользуемыеВидыЦен выше
// - Документ.УстановкаИндивидуальныхЦенНоменклатуры.ФормаДокумента
Функция ЗаполнитьИспользуемыеВидыЦенПользователя(ФормаОбъект, ТаблицаВидовЦен = Неопределено) Экспорт
	
	ЕстьИспользуемыеЦены = Ложь;
	
	Если ТаблицаВидовЦен = Неопределено Тогда
		ВидыЦенТЗ = Новый ТаблицаЗначений;
		ВидыЦенТЗ.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
		ВидыЦенТЗ.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	Иначе
		ВидыЦенТЗ = ТаблицаВидовЦен.Выгрузить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыЦенДокумента", ВидыЦенТЗ);
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦенДокумента.НомерСтроки КАК НомерСтроки,
	|	ВидыЦенДокумента.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВидыЦенДокумента КАК ВидыЦенДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка,
	|	ВидыЦен.Код,
	|	ВидыЦен.Архивный,
	|	ВидыЦен.ПометкаУдаления,
	|	ВидыЦен.СсылочныйВидЦены,
	|	ЕСТЬNULL(ВТ.НомерСтроки, 99999) КАК Порядок
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО (ВТ.ВидЦены = ВидыЦен.Ссылка)
	|ГДЕ
	// №6823 помеченные на удаление должны попадать
	//|	ВидыЦен.ПометкаУдаления = ЛОЖЬ
	|	НЕ ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	//#14002 порядок как в документе 
	|	ЕСТЬNULL(ВТ.НомерСтроки, 99999),
	|   ВидыЦен.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ВидЦеныИспользуется = Ложь;
		Если НЕ ТаблицаВидовЦен = Неопределено Тогда
			ВидЦеныИспользуется = (ТаблицаВидовЦен.НайтиСтроки(Новый Структура("ВидЦены", Выборка.Ссылка)).Количество() > 0);
		КонецЕсли;
		ЕстьИспользуемыеЦены = ЕстьИспользуемыеЦены ИЛИ ВидЦеныИспользуется;
		
		// №6823 помеченные на удаление виды цен, если их не было в существующем документе уберем
		Если Выборка.ПометкаУдаления И НЕ ВидЦеныИспользуется Тогда
			Продолжить;
		КонецЕсли;
		
		Если (Выборка.Архивный ИЛИ Выборка.СсылочныйВидЦены) И НЕ ВидЦеныИспользуется Тогда
			Продолжить;
		КонецЕсли;
		
		// пока делаем мягкую проверку
		//Если ПраваПользователей.ВидЦенДоступенПользователю(Выборка.Ссылка) Тогда
			НоваяСтрока = Новый Структура("ВидЦены, Код, Архивный, Запрещенный, ПометкаУдаления, ИмяКолонки, Устанавливать, Порядок");
			НоваяСтрока.ВидЦены = Выборка.Ссылка;
			НоваяСтрока.Код = Выборка.Код;
			НоваяСтрока.Архивный = Выборка.Архивный;
			НоваяСтрока.Запрещенный = НЕ ПраваПользователей.ВидЦенДоступенПользователю(Выборка.Ссылка);
			НоваяСтрока.ПометкаУдаления = Выборка.ПометкаУдаления;
			НоваяСтрока.ИмяКолонки = ИмяКолонкиПоВидуЦены(НоваяСтрока.ВидЦены);
			НоваяСтрока.Устанавливать = ВидЦеныИспользуется;
			НоваяСтрока.Порядок = Выборка.Порядок; //#14002 порядок как в документе
			
			НоваяСтрокаТаблицы = ФормаОбъект.ВидыЦен.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
			
		//Иначе
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нарушение прав доступа: в документе присутствуют запрещенные виды цен", ,,, Отказ);
		//	Возврат;
		//КонецЕсли;			
	КонецЦикла;

	Возврат ЕстьИспользуемыеЦены;
	
КонецФункции

Процедура УбратьНеиспользуемыеГруппыРекурсивно(ЭлементыДерева) Экспорт
	
	Колво = ЭлементыДерева.Количество();
	Для Индекс = 1 По Колво Цикл
		СтрокаДерева = ЭлементыДерева[Колво-Индекс];
		
		УбратьНеиспользуемыеГруппыРекурсивно(СтрокаДерева.Строки);
		
		Если СтрокаДерева.ЭтоГруппа И СтрокаДерева.Строки.Количество() = 0 Тогда
			ЭлементыДерева.Удалить(СтрокаДерева);
			Продолжить;
		КонецЕсли;
		
		//УбратьНеиспользуемыеГруппыРекурсивно(СтрокаДерева.Строки);		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидыЦенРекурсивно(ЭлементыДерева, ВидыЦен) Экспорт
	
	Для каждого СтрокаДерева из ЭлементыДерева Цикл
		Если НЕ СтрокаДерева.ЭтоГруппа Тогда
			НоваяСтрокаТаблицы = ВидыЦен.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаДерева);
		КонецЕсли;
		
		ЗаполнитьВидыЦенРекурсивно(СтрокаДерева.Строки, ВидыЦен);		
	КонецЦикла;
	
КонецПроцедуры

// есть схожая процедура в УстановкаЦенКлиент
Процедура ИзменитьПризнакУстанавливатьДляГрупп(Дерево) Экспорт
	
	// проверим необходимость установки галки на родительские группы
	// 1. получим все группы, начиная с "нижних"
	МассивГрупп = Новый Массив;
	НайтиГруппыРекурсивно(Дерево.Строки, МассивГрупп);
	
	Для каждого ЭлементДерева из Дерево.Строки Цикл
		Если ЭлементДерева.ЭтоГруппа Тогда
			МассивГрупп.Вставить(0, ЭлементДерева);
			НайтиГруппыРекурсивно(Дерево.Строки, МассивГрупп);
		КонецЕсли;
	КонецЦикла;
	
	// 2. проверим галки каждой группы
	Для каждого ЭлементГруппа из МассивГрупп Цикл
		ВсеУстановлены = Истина;
		Для каждого ЭлементДерева из ЭлементГруппа.Строки Цикл
			Если НЕ ЭлементДерева.Устанавливать Тогда
				ВсеУстановлены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ЭлементГруппа.Устанавливать = ВсеУстановлены;
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиГруппыРекурсивно(ЭлементыДерева, МассивГрупп)
	
	Для каждого ЭлементДерева из ЭлементыДерева Цикл
		Если ЭлементДерева.ЭтоГруппа Тогда
			МассивГрупп.Вставить(0, ЭлементДерева);
			НайтиГруппыРекурсивно(ЭлементДерева.Строки, МассивГрупп);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьУсловноеОформление(УсловноеОформлениеЭлементы) Экспорт
	
	//#13646
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(
		УсловноеОформлениеЭлементы, "ДеревоВидовЦенВидЦены", 
		Новый ПолеКомпоновкиДанных("ДеревоВидовЦен.Запрещенный"), ВидСравненияКомпоновкиДанных.Равно, Истина,
		ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет
	);
	
	//
	Элемент = УсловноеОформлениеЭлементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоВидовЦенУстанавливать");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоВидовЦен.Запрещенный");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаЦенНоменклатуры

// Возвращает уникальное имя колонки дерева цен по ссылке на вид цены
//
// Параметры:
//  ВидЦены - Ссылка на вид цены
//
// Возвращаемое значение:
//  Строка - Имя колонки вида цены.
//
Функция ИмяКолонкиПоВидуЦены(ВидЦены) Экспорт
	
	Значение = "ВидЦены" + СтрЗаменить(ВидЦены.УникальныйИдентификатор(), "-", "");	
	Возврат Значение;
	
КонецФункции

Функция ТаблицаСоответствия(Форма)
	
	ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров = Новый ТаблицаЗначений();
	
	СписокТипов = Новый Массив;
    СписокТипов.Добавить("СправочникСсылка.ЕдиницыИзмерений");
    СписокТипов.Добавить("СправочникСсылка.КлассификаторЕдиницИзмерения");
    ОписаниеТипаЕдиницИзмерения = Новый ОписаниеТипов(СписокТипов);
	
	ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров.Колонки.Добавить("Номенклатура",           		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры",  Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров.Колонки.Добавить("ЕдиницаИзмерения",  			ОписаниеТипаЕдиницИзмерения);
	ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров.Колонки.Добавить("СтрокаДереваЦен");
		
	ЭлементыНоменклатура = Форма.ДеревоЦен.ПолучитьЭлементы();	
	Для Каждого ЭлементНоменклатура Из ЭлементыНоменклатура Цикл
		
		НоваяСтрокаТЗ = ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементНоменклатура);
		НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементНоменклатура;
		
		ЭлементыХарактеристики = ЭлементНоменклатура.ПолучитьЭлементы();
		Для Каждого ЭлементХарактеристика Из ЭлементыХарактеристики Цикл
			
			НоваяСтрокаТЗ = ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементХарактеристика);
			НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементХарактеристика;
			
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров.Индексы.Добавить("Номенклатура, ХарактеристикаНоменклатуры");	
	Возврат ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров;
	
КонецФункции

// Осуществляет поиск строки дерева цен по полям (Номенклатура, Характеристика).
//
// Параметры:
//  Форма - УправляемаяФорма - Форма.
//  ПараметрыОтбора - Структура
//
// Возвращаемое значение:
//  Массив - Найденные строки таблицы.
//
Функция НайтиСтрокуДереваЦен(Форма, ПараметрыОтбора, ТаблицаСоответствия) Экспорт
		
	МассивСтрок = ТаблицаСоответствия.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		Возврат МассивСтрок[0].СтрокаДереваЦен;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьНоменклатуруВДеревоЦен(Форма, ТаблицаТовары, ДополнительныеПараметры = Неопределено) Экспорт
	
	//по всем единицам измерений и характеристикам выбранной номенклатуры
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	СправочникНоменклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО (ВТ_Товары.Номенклатура = СправочникНоменклатура.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СправочникЕдиницыИзмерений.Владелец,
	|	СправочникЕдиницыИзмерений.Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерений КАК СправочникЕдиницыИзмерений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО (ВТ_Товары.Номенклатура = СправочникЕдиницыИзмерений.Владелец)
	|ГДЕ
	|	НЕ СправочникЕдиницыИзмерений.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ВТ_Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Владелец = ВТ_Номенклатура.Номенклатура)
	|ИТОГИ ПО
	|	Номенклатура,
	|	ЕдиницаИзмерения";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();

	ТаблицаСоответствия = ТаблицаСоответствия(Форма);
	ЭлементыНоменклатура = Форма.ДеревоЦен.ПолучитьЭлементы();
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ВыборкаЕд = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЕд.Следующий() Цикл
			
			ПараметрыОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", ВыборкаНоменклатура.Номенклатура, ПустаяХарактеристика, ВыборкаЕд.ЕдиницаИзмерения);
			НайденнаяСтрока = НайтиСтрокуДереваЦен(Форма, ПараметрыОтбора, ТаблицаСоответствия);
			
			Если НайденнаяСтрока <> Неопределено Тогда
				ЭлементНоменклатура = НайденнаяСтрока;
			Иначе			
				ЭлементНоменклатура = ЭлементыНоменклатура.Добавить();
				ЗаполнитьЗначенияСвойств(ЭлементНоменклатура, ВыборкаЕд);
				ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементНоменклатура);
				
				НоваяСтрокаТЗ = ТаблицаСоответствия.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементНоменклатура);
				НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементНоменклатура;						
			КонецЕсли;
			
			ВыборкаХарактеристики = ВыборкаЕд.Выбрать();			
			ЭлементыХарактеристики = ЭлементНоменклатура.ПолучитьЭлементы();
			
			Пока ВыборкаХарактеристики.Следующий() Цикл
				
				Если ВыборкаХарактеристики.ХарактеристикаНоменклатуры = ПустаяХарактеристика Тогда
					Прервать;
				Иначе
					ЭлементНоменклатура.ХарактеристикиИспользуются = Истина;
				КонецЕсли;
				
				ПараметрыОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", ВыборкаХарактеристики.Номенклатура, ВыборкаХарактеристики.ХарактеристикаНоменклатуры, ВыборкаХарактеристики.ЕдиницаИзмерения);
				НайденнаяСтрока = НайтиСтрокуДереваЦен(Форма, ПараметрыОтбора, ТаблицаСоответствия);
				
				Если НайденнаяСтрока <> Неопределено Тогда
					ЭлементХарактеристика = НайденнаяСтрока;
				Иначе							
					ЭлементХарактеристика = ЭлементыХарактеристики.Добавить();
					ЗаполнитьЗначенияСвойств(ЭлементХарактеристика, ВыборкаХарактеристики);
					ЭлементХарактеристика.ХарактеристикиИспользуются = Истина;
					ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементХарактеристика);
					
					НоваяСтрокаТЗ = ТаблицаСоответствия.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, ЭлементХарактеристика);
					НоваяСтрокаТЗ.СтрокаДереваЦен = ЭлементХарактеристика;					
				КонецЕсли;
				
			КонецЦикла;					
		КонецЦикла;
	КонецЦикла;
			
КонецПроцедуры

Процедура ЗаполнитьНоменклатуруПоГруппе(Форма, ГруппаНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	|	И НЕ Номенклатура.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);
	
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	ДобавитьНоменклатуруВДеревоЦен(Форма, ТаблицаТовары);
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаЦенНаПродукцию

// вызов из документа УстановкаЦенМатериалов
Процедура ПостроитьТаблицуЦенФактур(Форма, ИмяТаблицы = "Цены", Валюта) Экспорт
	
	ДобавляемыеКолонкиТаблицыЦен = Новый Массив();
	УдаляемыеКолонкиТаблицыЦен   = Новый Массив();
	УдаляемыеЭлементы            = Новый Массив();
	УсловныеОформления           = Новый Массив();
	
	СписокТипов = Новый Массив;
    СписокТипов.Добавить("СправочникСсылка.ЕдиницыИзмерений");
    СписокТипов.Добавить("СправочникСсылка.КлассификаторЕдиницИзмерения");
    ОписаниеТипаЕдиницИзмерения = Новый ОписаниеТипов(СписокТипов);

	ДеревоЗначений = Новый ТаблицаЗначений;	
	
	//ДеревоЗначений.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный))));
	ДеревоЗначений.Колонки.Добавить("Фактура",     Новый ОписаниеТипов("СправочникСсылка.Фактура"));
	ДеревоЗначений.Колонки.Добавить("ЦветФактуры", Новый ОписаниеТипов("СправочникСсылка.ЦветФактуры"));	
	ДеревоЗначений.Колонки.Добавить("Шаблон", 	   Новый ОписаниеТипов("СправочникСсылка.ШаблоныПродукции"));
	ДеревоЗначений.Колонки.Добавить("ПараметрПродукции", 	   	Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПараметрыПродукции"));
	ДеревоЗначений.Колонки.Добавить("Номенклатура", 	   		Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПараметрыПродукции"));
	ДеревоЗначений.Колонки.Добавить("ЕдиницаИзмерения",  		ОписаниеТипаЕдиницИзмерения);
	
	Для Каждого ВидЦены Из Форма.ВидыЦен Цикл		
		Если ВидЦены.Устанавливать Тогда
			
			ИмяКолонки = УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(ВидЦены.ВидЦены);
			
			ДеревоЗначений.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)), ВидЦены.ВидЦены);		
			ДеревоЗначений.Колонки.Добавить(ИмяКолонки + "Фото", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)), ВидЦены.ВидЦены);		
					
		КонецЕсли;		
	КонецЦикла;
	
	КолонкаОтступ = ДеревоЗначений.Колонки.Добавить("Отступ", Новый ОписаниеТипов("Строка"), НСтр("ru = 'Отступ'"));
	
	РеквизитыТаблицыЦен = Форма.ПолучитьРеквизиты(ИмяТаблицы);
	Для Каждого Реквизит Из РеквизитыТаблицыЦен Цикл
		Если СтрНайти(Реквизит.Имя, "ВидЦены") ИЛИ СтрНайти(Реквизит.Имя, "Отступ") Тогда
			УдаляемыеКолонкиТаблицыЦен.Добавить(ИмяТаблицы + "." + Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
		Если СтрНайти(Колонка.Имя, "ВидЦены") Тогда
			УдаляемаяКолонка = УдаляемыеКолонкиТаблицыЦен.Найти(ИмяТаблицы + "." + Колонка.Имя);
			Если УдаляемаяКолонка <> Неопределено Тогда
				УдаляемыеКолонкиТаблицыЦен.Удалить(УдаляемаяКолонка);
			Иначе
				ДобавляемыеКолонкиТаблицыЦен.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТаблицы, Колонка.Заголовок, Истина));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДобавляемыеКолонкиТаблицыЦен.Добавить(Новый РеквизитФормы(КолонкаОтступ.Имя, КолонкаОтступ.ТипЗначения, ИмяТаблицы, КолонкаОтступ.Заголовок, Истина));
	
	Если УдаляемыеКолонкиТаблицыЦен.Количество() > 0 Или ДобавляемыеКолонкиТаблицыЦен.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеКолонкиТаблицыЦен, УдаляемыеКолонкиТаблицыЦен);
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из Форма.Элементы[ИмяТаблицы].ПодчиненныеЭлементы Цикл
		Если СтрНайти(ТекЭлемент.Имя, "ВидЦены") ИЛИ СтрНайти(ТекЭлемент.Имя, "Отступ") Тогда
			УдаляемыеЭлементы.Добавить(ТекЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Форма.Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	Для Каждого Оформление Из Форма.УсловноеОформление.Элементы Цикл
		Если Оформление.Представление = "СозданоПрограммно" Тогда
			УсловныеОформления.Добавить(Оформление);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Оформление Из УсловныеОформления Цикл
		Форма.УсловноеОформление.Элементы.Удалить(Оформление);
	КонецЦикла;
	
	Для Каждого ВидЦены Из Форма.ВидыЦен Цикл
		
		Если ВидЦены.Устанавливать Тогда 
		
			ИмяКолонки = УстановкаЦенСервер.ИмяКолонкиПоВидуЦены(ВидЦены.ВидЦены);
			
			ЦветЗаголовка = Неопределено;
			ЦветФона      = Неопределено;
			КартинкаШапки = Неопределено;
			
			ЦветФона      = WebЦвета.ШелковыйОттенок;		
			
			НоваяГруппа = ОбщийМодульСервер.ДобавитьГруппуФормы(Форма, "ГруппаЦены" + ИмяКолонки, Строка(ВидЦены.ВидЦены) + ", " + Строка(Валюта), Истина, КартинкаШапки, ГруппировкаКолонок.Горизонтальная, Форма.Элементы.Цены);
			
			//ЗаголовокКолонкиСтараяЦена = НСтр("ru='Старая цена'");			
					
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Цена за кв.м.'"));
			СтруктураПараметров.Вставить("ПутьКДанным",            "Цены." + ИмяКолонки);
			СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ЦеныЦенаПриИзменении");
			СтруктураПараметров.Вставить("ШиринаПоля",             12);
			СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
			СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
			СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
			СтруктураПараметров.Вставить("ТолькоПросмотрПоля", 	   ВидЦены.Запрещенный);
			
			НовоеПоле = ОбщийМодульСервер.ДобавитьПолеФормы(Форма, ИмяКолонки, СтруктураПараметров);
			
			ИмяКолонки = ИмяКолонки + "Фото";
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Цена за кв.м. с фотопечатью'"));
			СтруктураПараметров.Вставить("ПутьКДанным",            "Цены." + ИмяКолонки);
			//СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенЦенаПриИзменении");
			СтруктураПараметров.Вставить("ШиринаПоля",             12);
			СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
			СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
			СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
			СтруктураПараметров.Вставить("ТолькоПросмотрПоля", 	   ВидЦены.Запрещенный);
			
			НовоеПоле = ОбщийМодульСервер.ДобавитьПолеФормы(Форма, ИмяКолонки, СтруктураПараметров);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ШиринаПоля",             1); //3);
	СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
	СтруктураПараметров.Вставить("ПутьКДанным",            "Цены.Отступ");
	СтруктураПараметров.Вставить("Родитель",               Форма.Элементы.Цены);
	
	НовоеПоле = ОбщийМодульСервер.ДобавитьПолеФормы(Форма, "Отступ", СтруктураПараметров);
	НовоеПоле.ЦветТекста = WebЦвета.Серый;
	НовоеПоле.Видимость  = Истина;
	НовоеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовоеПоле.РастягиватьПоГоризонтали = Ложь; //Истина;

	
	ДеревоЦенЗначение = Форма.РеквизитФормыВЗначение(ИмяТаблицы);
	ДеревоЦенЗначение.Колонки.Очистить();
	
	Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
		ДеревоЦенЗначение.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Форма.ЗначениеВРеквизитФормы(ДеревоЦенЗначение, ИмяТаблицы);	
	
КонецПроцедуры

Процедура ОбработкаВыбораПодбораФактуры(ТаблицаФактур, ТабличнаяЧасть, ДополнительныеПараметры = Неопределено) Экспорт
	
	Для Каждого ТекущаяСтрока из ТаблицаФактур Цикл
		СтруктураОтбора = Новый Структура("Фактура, ЦветФактуры", ТекущаяСтрока.Фактура, ТекущаяСтрока.ЦветФактуры);
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			Если НЕ ДополнительныеПараметры = Неопределено Тогда				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеПараметры);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаВыбораПодбораШаблонов(ТаблицаПодбора, ТабличнаяЧасть, ДополнительныеПараметры = Неопределено) Экспорт
	
	Для Каждого ТекущаяСтрока из ТаблицаПодбора Цикл
		СтруктураОтбора = Новый Структура("Шаблон", ТекущаяСтрока.Шаблон);
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			Если НЕ ДополнительныеПараметры = Неопределено Тогда				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеПараметры);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоСправочникуФактур(ТабличнаяЧасть, ГруппаФактур = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ДополнительныеПараметры = Неопределено И ДополнительныеПараметры.Свойство("КлючСвязи") Тогда
		МассивСтрокКУдалению = ТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСвязи", ДополнительныеПараметры.КлючСвязи)); 
		Для каждого Строка Из МассивСтрокКУдалению Цикл 
			ТабличнаяЧасть.Удалить(Строка); 
		КонецЦикла;
	Иначе
		ТабличнаяЧасть.Очистить();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаФактур", ГруппаФактур);
	Запрос.УстановитьПараметр("ОтборПоГруппе", ЗначениеЗаполнено(ГруппаФактур));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Фактура.Ссылка КАК Фактура,
	|	ЦветФактуры.Ссылка КАК ЦветФактуры
	|ИЗ
	|	Справочник.Фактура КАК Фактура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦветФактуры КАК ЦветФактуры
	|		ПО Фактура.Ссылка = ЦветФактуры.Владелец
	|			И (НЕ ЦветФактуры.ПометкаУдаления)
	|ГДЕ
	|	НЕ Фактура.ЭтоГруппа
	|	И НЕ Фактура.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ОтборПоГруппе
	|				ТОГДА Фактура.Ссылка В ИЕРАРХИИ (&ГруппаФактур)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Фактура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если НЕ ДополнительныеПараметры = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеПараметры);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоСправочникуШаблонов(ТабличнаяЧасть, ВидПродукции = Неопределено, ГруппаШаблонов = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ДополнительныеПараметры = Неопределено И ДополнительныеПараметры.Свойство("КлючСвязи") Тогда
		МассивСтрокКУдалению = ТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСвязи", ДополнительныеПараметры.КлючСвязи)); 
		Для каждого Строка Из МассивСтрокКУдалению Цикл 
			ТабличнаяЧасть.Удалить(Строка); 
		КонецЦикла;
	Иначе
		ТабличнаяЧасть.Очистить();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
	Запрос.УстановитьПараметр("ОтборПоВидуПродукции", ЗначениеЗаполнено(ВидПродукции));
	Запрос.УстановитьПараметр("ГруппаШаблонов", ГруппаШаблонов);
	Запрос.УстановитьПараметр("ОтборПоГруппе", ЗначениеЗаполнено(ГруппаШаблонов));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шаблоны.Ссылка КАК Шаблон
	|ИЗ
	|	Справочник.ШаблоныПродукции КАК Шаблоны
	|ГДЕ
	|	НЕ Шаблоны.ЭтоГруппа
	|	И НЕ Шаблоны.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ОтборПоВидуПродукции
	|				ТОГДА Шаблоны.ВидПродукции = &ВидПродукции
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоГруппе
	|				ТОГДА Шаблоны.Ссылка В ИЕРАРХИИ (&ГруппаШаблонов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Шаблон
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если НЕ ДополнительныеПараметры = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеПараметры);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
